of90/tutorials/rheoMultiRegionFoam/sphere/PTTLog/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//----GEO
// X

x0 -200;
x1 -2;
x2 -200;
x3 -1;
x4 -0.7071067812;
x5 0;
x6 0.7071067812;
x7 1;
x8 200;
x9 2;
x10 200;

x21 -141.4213562373;
x23 141.4213562373;

// Y

y0 0;
y4 0.7071067812;
y5 1;
y6 0.7071067812;
y19 141.4213562373;
y18 2;
y50 200;

y22 200;

// Z

z0 -1;
z1 0;

//---MESH
//-N
ny0_19 40;
ny19_18 10;
ny18_50 25;

nx0_1 80; nx9_10 80;
nx1_2 12; nx8_9 12;
nx4_5 35; nx5_6 35;

nR 117;

//-G
gy0_19_A 5; gy0_19_B 0.75;
gy19_18 1.5; 
gy18_50 220;  

gx0_1 0.01; gx9_10 100;
gx1_2 1; gx8_9 1;
gx4_5 1; gx5_6 1;

gR 2000; igR 0.0005;

vertices
(
   ($x0 $y0 $z0)
   ($x1 $y0 $z0)
   ($x2 $y0 $z0)
   ($x3 $y0 $z0) //3
   ($x4 $y4 $z0)  
   ($x5 $y5 $z0)
   ($x6 $y6 $z0)
   ($x7 $y0 $z0) //7
   ($x8 $y0 $z0)
   ($x9 $y0 $z0)
   ($x10 $y0 $z0) //10
   
   ($x10 $y19 $z0)
   ($x10 $y18 $z0)
   ($x9 $y18 $z0)
   ($x23 $y18 $z0) //14
   ($x5 $y18 $z0)
   ($x21 $y18 $z0)
   ($x1 $y18 $z0)
   ($x0 $y18 $z0)
   ($x0 $y19 $z0) //19
   
   ($x1 $y19 $z0)
   ($x21 $y19 $z0)
   ($x5 $y22 $z0)
   ($x23 $y19 $z0)
   ($x9 $y19 $z0) //24
   
   //-----------------
   
   ($x0 $y0 $z1)
   ($x1 $y0 $z1)
   ($x2 $y0 $z1)
   ($x3 $y0 $z1) //3
   ($x4 $y4 $z1)
   ($x5 $y5 $z1)
   ($x6 $y6 $z1)
   ($x7 $y0 $z1) //7
   ($x8 $y0 $z1)
   ($x9 $y0 $z1)
   ($x10 $y0 $z1) //10
   
   ($x10 $y19 $z1)
   ($x10 $y18 $z1)
   ($x9 $y18 $z1)
   ($x23 $y18 $z1) //14
   ($x5 $y18 $z1)
   ($x21 $y18 $z1)
   ($x1 $y18 $z1)
   ($x0 $y18 $z1)
   ($x0 $y19 $z1) //19
   
   ($x1 $y19 $z1)
   ($x21 $y19 $z1)
   ($x5 $y22 $z1)
   ($x23 $y19 $z1)
   ($x9 $y19 $z1) //24
   
   //---------------
   // Extra blocks top
   
   ($x0 $y50 $z0)
   ($x1 $y50 $z0)
   ($x21 $y50 $z0)
   ($x5 $y50 $z0)
   ($x23 $y50 $z0)
   ($x9 $y50 $z0)
   ($x10 $y50 $z0)
   
   ($x0 $y50 $z1)
   ($x1 $y50 $z1)
   ($x21 $y50 $z1)
   ($x5 $y50 $z1)
   ($x23 $y50 $z1)
   ($x9 $y50 $z1)
   ($x10 $y50 $z1)
   
);

blocks
(
   
        
    hex (2 3 4 21 27 28 29 46) fluid ($nR $ny0_19 1) simpleGrading 
    (
     $igR                 
     (
       (0.5 0.6 $gy0_19_A)    
       (0.5 0.4 $gy0_19_B)    
     )
     1 
    ) //4
    
    hex (4 5 22 21 29 30 47 46) fluid ($nx4_5 $nR 1) simpleGrading ($gx4_5 $gR 1) //5    
     
    hex (5 6 23 22 30 31 48 47) fluid ($nx5_6 $nR 1) simpleGrading ($gx5_6 $gR 1) //7    
    
    hex (7 8 23 6 32 33 48 31) fluid ($nR $ny0_19 1) simpleGrading
    (
     $gR                  
     (
       (0.5 0.6 $gy0_19_A)    
       (0.5 0.4 $gy0_19_B)    
     )
     1 
    ) //9      
     
);

edges
(

  arc 3 4  (-0.9238795325 0.3826834324 $z0)  
  arc 4 5  (-0.3826834324 0.9238795325 $z0)
  arc 5 6  (0.3826834324 0.9238795325 $z0)    
  arc 6 7  (0.9238795325 0.3826834324 $z0)    
  
  arc 2 21  (-184.7759065023 76.536686473 $z0)  
  arc 21 22  (-76.536686473 184.7759065023 $z0)   
  arc 22 23  (76.536686473 184.7759065023 $z0)   
  arc 23 8  (184.7759065023 76.536686473 $z0) 
  
  //---
  
  arc 28 29  (-0.9238795325 0.3826834324 $z1)  
  arc 29 30  (-0.3826834324 0.9238795325 $z1)
  arc 30 31  (0.3826834324 0.9238795325 $z1)     
  arc 31 32 (0.9238795325 0.3826834324 $z1)    
 
  
  arc 27 46  (-184.7759065023 76.536686473 $z1)  
  arc 46 47  (-76.536686473 184.7759065023 $z1)   
  arc 48 47  (76.536686473 184.7759065023 $z1)   
  arc 33 48 (184.7759065023 76.536686473 $z1)  
   
);

boundary
(

    inlet
    {
      type patch;
      faces
      (
           (2 21 46 27)
           (21 22 47 46)       
      );
    }
     
    sphere
    {
        type wall;
        faces
        (
           (3 4 29 28)
           (4 5 30 29)
           (5 6 31 30)
           (7 6 31 32)            
        );
    }
    outlet
    {
        type patch;
        faces
        (
           (22 23 48 47)
           (23 8 33 48)         
        );
    }    
    front
    {
        type empty;
        faces
        (
           (27 28 29 46)
           (29 30 47 46)
           (30 31 48 47)
           (31 32 33 48)        
        );
    }     
    
    back
    {
        type empty;
        faces
        (
           (2 3 4 21)
           (4 5 22 21)
           (5 6 23 22)
           (7 8 23 6)     
        );
    } 
      
);

mergePatchPairs
(
);

// ************************************************************************* //
