of90/tutorials/rheoMultiRegionFoam/sphere/PTTLog/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    
    outlet
    {
        type            zeroGradient;   
    }

    walls
    {
       type            zeroGradient;     
    }
    
    map.fluid
    {   
        type                    coupledT;
        nbrFieldName            "T";
        isContactResistance     true;
        hres                    10;
        value                   uniform 1;
    }
    
    "(front|back)"
    {
        type          wedge;
    }
    
}

// ************************************************************************* //
